app/views/games/show.html.erb

SELECT "game_players".* FROM "game_players" WHERE "game_players"."game_id" = $1  [["game_id", 3]]
SELECT "players".* FROM "players" INNER JOIN "player_rounds" ON "players"."id" = "player_rounds"."player_id" WHERE "player_rounds"."round_id" = $1  [["round_id", 5]]
---
      <ul>
        <% round.players.each do |player| %>

SELECT "rounds".* FROM "rounds" WHERE "rounds"."game_id" = $1 LIMIT $2  [["game_id", 1], ["LIMIT", 1]]
---
<ul>
  <% @game.rounds[0].players.each do |player| %>