app/controllers/application_controller.rb

  def player_score(player,round)
    PlayerRound.find_by(player_id: player.id,round_id: round.id).score
---
SELECT "player_rounds".* FROM "player_rounds" WHERE "player_rounds"."player_id" = $1 AND "player_rounds"."round_id" = $2 LIMIT $3  [["player_id", 4], ["round_id", 5], ["LIMIT", 1]]

  def total_points(game,player_to_find)
    score = 0

    game.rounds.each do |round|
      round.players.each do |player|
---
SELECT "players".* FROM "players" INNER JOIN "player_rounds" ON "players"."id" = "player_rounds"."player_id" WHERE "player_rounds"."round_id" = $1  [["round_id", 11]]