app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" IN ($1, $2)  [["id", 4], ["id", 5]]
SELECT "rounds".* FROM "rounds" WHERE "rounds"."game_id" = $1 LIMIT $2  [["game_id", 1], ["LIMIT", 1]]
---
  def show
    @game = Game.includes(:rounds,:players).find_by(id: params[:id])