app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT "games".* FROM "games" WHERE (1) LIMIT $1  [["LIMIT", 1]]

  def new
    @players = Player.all
---
SELECT "players".* FROM "players" WHERE 1=0

  def create
    @game = Game.new()

    if @game.save
      params[:game][:player_ids].each do |id|
        GamePlayer.create(game_id: @game.id, player_id: id)
---
INSERT INTO "games" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-01-27 01:34:40.361498"], ["updated_at", "2021-01-27 01:34:40.361498"]]
SELECT "games".* FROM "games" ORDER BY "games"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "game_players" ("game_id", "player_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["game_id", 3], ["player_id", 1], ["created_at", "2021-01-27 01:34:44.123974"], ["updated_at", "2021-01-27 01:34:44.123974"]]

  def show
    @game = Game.includes(:rounds,:players).find_by(id: params[:id])
---
SELECT "game_players".* FROM "game_players" WHERE "game_players"."game_id" = $1  [["game_id", 3]]
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "rounds".* FROM "rounds" WHERE "rounds"."game_id" = $1  [["game_id", 3]]