app/controllers/rounds_controller.rb

  def create
    @round = Round.new
    @round.game_id = params[:game_id]
    @game = Game.includes(:rounds,:players).find_by(id: params[:game_id])
    player_rounds = []
    bool = true

    params.keys.each do |key|
      if key.include?("player")
        if params[key][:pos_score].length == 0 || params[key][:neg_score].length == 0 || !!!(params[key][:pos_score] =~ /\A[-+]?[0-9]+\z/) || !!!(params[key][:neg_score] =~ /\A[-+]?[0-9]+\z/)
          flash.now[:errors] = "you inputed an invalid score"
          bool = false
        else
          player_rounds.push(PlayerRound.new(score: (params[key][:pos_score].to_i - 2*params[key][:neg_score].to_i), player_id: params[key][:id]))
        end
      end
    end

    if bool and @round.save
      player_rounds.each do |player_round|
        player_round.round_id = @round.id
        player_round.save
---
SELECT "game_players".* FROM "game_players" WHERE "game_players"."game_id" = $1  [["game_id", 3]]
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" IN ($1, $2)  [["id", 13], ["id", 14]]
SELECT "rounds".* FROM "rounds" WHERE "rounds"."game_id" = $1  [["game_id", 11]]
INSERT INTO "player_rounds" ("round_id", "player_id", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["round_id", 14], ["player_id", 4], ["score", 40], ["created_at", "2021-01-25 23:59:12.502558"], ["updated_at", "2021-01-25 23:59:12.502558"]]
INSERT INTO "rounds" ("game_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["game_id", 9], ["created_at", "2021-01-26 00:30:03.274000"], ["updated_at", "2021-01-26 00:30:03.274000"]]
INSERT INTO "rounds" ("game_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["game_id", 11], ["created_at", "2021-01-26 04:08:10.324205"], ["updated_at", "2021-01-26 04:08:10.324205"]]
SELECT "player_rounds".* FROM "player_rounds" WHERE "player_rounds"."round_id" IN ($1, $2, $3)  [["round_id", 49], ["round_id", 50], ["round_id", 51]]
UPDATE "rounds" SET "game_id" = $1, "updated_at" = $2 WHERE "rounds"."id" = $3  [["game_id", 1], ["updated_at", "2021-01-22 23:22:22.004892"], ["id", 15]]
INSERT INTO "player_rounds" ("round_id", "player_id", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["round_id", 54], ["player_id", 13], ["score", 12], ["created_at", "2021-01-26 04:08:59.157060"], ["updated_at", "2021-01-26 04:08:59.157060"]]